Revit 2027 API
IFCUserDefinedPropertySetType Enumeration
 An enumerated type listing user-defined property set types.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum IFCUserDefinedPropertySetType
Public Enumeration IFCUserDefinedPropertySetType
public enum class IFCUserDefinedPropertySetType
type IFCUserDefinedPropertySetType
Members
Member name | Value | Description
IFCAttributeSet | 2 |  The property set is a IFC Attribute set.
PropertySet | 0 |  The property set is a property set.
QuantitySet | 1 |  The property set is a quantity set.
See Also
Reference
Autodesk.Revit.DB Namespace